CREATE DATABASE accounting;

\c accounting;

CREATE TABLE IF NOT EXISTS product(
    id SERIAL PRIMARY KEY,
    name VARCHAR(50) NOT NULL,
    active BOOLEAN DEFAULT TRUE,
    start_date DATE NOT NULL DEFAULT CURRENT_DATE
);

CREATE TABLE IF NOT EXISTS sku(
    id SERIAL PRIMARY KEY,
    sku_code VARCHAR(50) UNIQUE NOT NULL,
    color VARCHAR(30),
    size VARCHAR(10),
    price DECIMAL(8, 2) NOT NULL,
    product_id INT REFERENCES product(id) ON DELETE CASCADE
);

INSERT INTO product (name, active, start_date)
    VALUES ('Толстовка', TRUE, '2024-05-14'),
           ('Футболка', TRUE, '2024-08-01'),
           ('Джинсы', TRUE, '2024-10-02'),
           ('Куртка', TRUE, '2024-03-03'),
           ('Шорты', TRUE, '2024-02-04'),
           ('Брюки', TRUE, '2024-01-06'),
           ('Рубашка', TRUE, '2024-0-912'),
           ('Свитер', FALSE, '2024-01-08'),
           ('Ботинки', TRUE, '2024-01-10'),
           ('Кроссовки', TRUE, '2023-12-26'),
           ('Сапоги', TRUE, '2024-01-12'),
           ('Пальто', TRUE, '2024-01-13'),
           ('Шапка',  FALSE, '2024-01-14'),
           ('Перчатки', TRUE, '2024-01-15'),
           ('Шарф', FALSE, '2024-01-16'),
           ('Холодильник', FALSE, '2024-07-21'),
           ('Смартфон', TRUE, '2024-04-07'),
           ('Ноутбук', TRUE, '2024-08-24'),
           ('Наушники', TRUE, '2024-07-14'),
           ('Часы', TRUE, '2023-12-24');


-- INSERT INTO sku (sku_code, color, size, price, product_id)
--     VALUES ('Белый', 'XS', 44.99, 1), ('Белый', 'S', 44.99, 1), ('Черный', 'M', 49.99, 1),
--     ('Черный', 'L', 49.99, 1), ('Серый', 'XL', 54.99, 1),('Серый', 'XXL', 54.99, 1),
--     ('Белый', 'S', 59.99, 2), ('Черный', 'M', 64.99, 2), ('Черный', 'L', 64.99, 2),
--     ('Синий', 'XL', 69.99, 2), ('Красный', 'XS', 99.99, 3), ('Красный', 'S', 99.99, 3),
--     ('Черный', 'M', 104.99, 3), ('Черный', 'L', 104.99, 3), ('Синий', 'XL', 109.99, 3),
--     ('Зеленый', 'XS', 24.99, 4), ('Зеленый', 'S', 24.99, 4), ('Черный', 'M', 29.99, 4),
--     ('Черный', 'L', 29.99, 4), ('Синий', 'XL', 34.99, 4), ('Розовый', 'XS', 79.99, 5),
--     ('Розовый', 'S', 79.99, 5), ('Черный', 'M', 84.99, 5), ('Черный', 'L', 84.99, 5),
--     ('Синий', 'XL', 89.99, 5), ('Серый', 'XS', 49.99, 6), ('Серый', 'S', 49.99, 6),
--     ('Черный', 'M', 54.99, 6), ('Черный', 'L', 54.99, 6), ('Синий', 'XL', 59.99, 6),
--     ('Белый', 'XS', 39.99, 7), ('Белый', 'S', 39.99, 7), ('Черный', 'M', 44.99, 7),
--     ('Черный', 'L', 44.99, 7), ('Синий', 'XL', 49.99, 7), ('Черный', 'XS', 54.99, 8),
--     ('Черный', 'S', 54.99, 8), ('Белый', 'M', 59.99, 8), ('Белый', 'L', 59.99, 8),
--     ('Синий', 'XL', 64.99, 8), ('Синий', '37', 34.99, 9), ('Синий', '41', 34.99, 9),
--     ('Черный', '36', 39.99, 9), ('Черный', '35', 39.99, 9), ('Белый', '44', 44.99, 9),
--     ('Красный', '46', 89.99, 10), ('Красный', '48', 89.99, 10), ('Черный', '46', 94.99, 10),
--     ('Черный', '42', 94.99, 10), ('Синий', '41', 99.99, 10), ('Зеленый', '40', 69.99, 11),
--     ('Зеленый', '38', 69.99, 11), ('Черный', '40', 74.99, 11), ('Черный', '36', 74.99, 11),
--     ('Синий', '36', 79.99, 11), ('Розовый', 'XS', 109.99, 12), ('Розовый', 'S', 109.99, 12),
--     ('Черный', 'M', 114.99, 12), ('Черный', 'L', 114.99, 12), ('Синий', 'XL', 119.99, 12),
--     ('Серый', 'XS', 84.99, 13), ('Серый', 'S', 84.99, 13), ('Черный', 'M', 89.99, 13),
--     ('Черный', 'L', 89.99, 13), ('Синий', 'XL', 94.99, 13), ('Белый', 'XS', 29.99, 14),
--     ('Белый', 'S', 29.99, 14), ('Черный', 'M', 34.99, 14), ('Черный', 'L', 34.99, 14),
--     ('Синий', 'XL', 39.99, 14),('Черный', 49.99, 15), ('Черный', 49.99, 15),
--     ('Белый', 54.99, 15), ('Белый', 54.99, 15), ('Синий', 59.99, 15),
--     ('Белый', 34.99, 16), ('Черный', 34.99, 16), ('Темно Серый', 679.99, 16),
--     ('Светло Серый', 679.99, 16), ('Красный', 668.99, 16), ('Красный', 89.99, 17),
--     ('Красный', 89.99, 17), ('Черный', 94.99, 17), ('Черный', 94.99, 17),
--     ('Синий', 99.99, 17), ('Зеленый', 69.99, 18), ('Зеленый', 69.99, 18),
--     ('Черный', 74.99, 18), ('Черный', 74.99, 18), ('Синий', 79.99, 18),
--     ('Розовый', 109.99, 19), ('Розовый', 109.99, 19), ('Черный', 114.99, 19),
--     ('Черный', 114.99, 19), ('Синий', 119.99, 19), ('Серый', 84.99, 20),
--     ('Серый', 84.99, 20), ('Черный', 89.99, 20), ('Черный', 89.99, 20);